GYD-418/ota-esp32-stm32/ESPOTA/main/ESPOTA.c
#include <stdint.h>
#include <string.h>

#include "esp_err.h"
#include "esp_event.h"
#include "esp_http_client.h"
#include "esp_http_server.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/task.h"
#include "nvs_flash.h"

#include "driver/gpio.h"
#include "driver/uart.h"
#include "ota_config.h"
#include "ota_manager.h"
#include "status_led.h"
#include "stm32_forwarder.h"
#include "wifi_provisioning/ssid_manager.h"
#include "wifi_provisioning/wifi_config_ap.h"

#define AP_SSID_PREFIX          "ESP32-OTA"

static const char *TAG = "espota";

/* ---------- netif ---------- */
static esp_netif_t *s_sta_netif = NULL;

/* ---------- event group bits ---------- */
#define STA_STARTED_BIT   BIT0
#define STA_CONNECTED_BIT BIT1
#define STA_FAIL_BIT      BIT2
#define SCAN_DONE_BIT     BIT3

static EventGroupHandle_t s_sta_evt_group;
static httpd_handle_t s_ota_server = NULL;

/* ---------- EMBED_TXTFILES symbols ---------- */
extern const char dashboard_html_start[] asm("_binary_dashboard_html_start");

/* ========================================================================
 *  OTA HTTP handlers
 * ======================================================================== */

/* GET /api/version */
static esp_err_t version_handler(httpd_req_t *req)
{
    char json[128];
    const char *ver = ota_manager_get_version();
    const char *pending = ota_manager_get_pending_version();
    snprintf(json, sizeof(json),
             "{\"version\":\"%s\",\"pending\":%s}",
             ver, pending ? pending : "null");
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send(req, json, strlen(json));
    return ESP_OK;
}

/* GET /api/ota/status */
static esp_err_t ota_status_handler(httpd_req_t *req)
{
    char json[64];
    snprintf(json, sizeof(json), "{\"running\":%s}",
             ota_manager_is_running() ? "true" : "false");
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send(req, json, strlen(json));
    return ESP_OK;
}

/* GET /  — OTA dashboard */
static esp_err_t dashboard_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send(req, dashboard_html_start, strlen(dashboard_html_start));
    return ESP_OK;
}

/* POST /api/stm32/update  — body: {"url": "http://..."} */
static esp_err_t stm32_update_handler(httpd_req_t *req)
{
    char buf[512] = {0};
    int ret = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (ret <= 0) { httpd_resp_send_500(req); return ESP_FAIL; }
    buf[ret] = '\0';

    char url[256] = {0};
    char *url_key = strstr(buf, "\"url\"");
    if (url_key) {
        char *colon = strchr(url_key + 5, ':');
        if (colon) {
            char *start = strchr(colon + 1, '"');
            if (start) {
                start++;
                char *end = strchr(start, '"');
                if (end) {
                    int len = (end - start < 255) ? (int)(end - start) : 255;
                    strncpy(url, start, len);
                }
            }
        }
    }

    if (strlen(url) == 0) {
        httpd_resp_set_type(req, "application/json");
        httpd_resp_set_hdr(req, "Connection", "close");
        httpd_resp_send(req, "{\"success\":false,\"error\":\"URL required\"}",
                        HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }

    if (stm32_forwarder_is_running()) {
        httpd_resp_set_type(req, "application/json");
        httpd_resp_set_hdr(req, "Connection", "close");
        httpd_resp_send(req, "{\"success\":false,\"error\":\"STM32 OTA already running\"}",
                        HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }

    ESP_LOGI(TAG, "STM32 OTA triggered: %s", url);
    status_led_ota_stm32(0);

    esp_err_t err = stm32_forwarder_start(url, NULL);
    if (err != ESP_OK) {
        status_led_error();
    }
    /* LED restores to connected when forwarder_task exits */
    ESP_LOGI(TAG, "STM32 OTA start result: %s", err == ESP_OK ? "OK" : esp_err_to_name(err));
    if (err != ESP_OK) {
        char resp[128];
        snprintf(resp, sizeof(resp), "{\"success\":false,\"error\":\"%s\"}",
                 esp_err_to_name(err));
        httpd_resp_set_type(req, "application/json");
        httpd_resp_set_hdr(req, "Connection", "close");
        httpd_resp_send(req, resp, strlen(resp));
        return ESP_OK;
    }

    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send(req, "{\"success\":true}", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

/* GET /api/stm32/status */
static esp_err_t stm32_status_handler(httpd_req_t *req)
{
    char json[64];
    snprintf(json, sizeof(json), "{\"running\":%s}",
             stm32_forwarder_is_running() ? "true" : "false");
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send(req, json, strlen(json));
    return ESP_OK;
}

/* POST /api/ota/update  — body: {"url": "http://..."} */
static esp_err_t ota_update_handler(httpd_req_t *req)
{
    char buf[512] = {0};
    int ret = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (ret <= 0) {
        httpd_resp_send_500(req);
        return ESP_FAIL;
    }
    buf[ret] = '\0';

    char url[256] = {0};

    /* parse "url" from JSON */
    char *url_key = strstr(buf, "\"url\"");
    if (url_key) {
        char *colon = strchr(url_key + 5, ':');
        if (colon) {
            char *start = strchr(colon + 1, '"');
            if (start) {
                start++;
                char *end = strchr(start, '"');
                if (end) {
                    int len = end - start;
                    if (len > (int)sizeof(url) - 1) len = sizeof(url) - 1;
                    strncpy(url, start, len);
                }
            }
        }
    }

    if (strlen(url) == 0) {
        httpd_resp_set_type(req, "application/json");
        httpd_resp_set_hdr(req, "Connection", "close");
        httpd_resp_send(req, "{\"success\":false,\"error\":\"URL required\"}",
                        HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }

    if (ota_manager_is_running()) {
        httpd_resp_set_type(req, "application/json");
        httpd_resp_set_hdr(req, "Connection", "close");
        httpd_resp_send(req, "{\"success\":false,\"error\":\"OTA already running\"}",
                        HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }

    ESP_LOGI(TAG, "OTA update triggered: %s", url);
    status_led_ota_esp32(0);

    esp_err_t err = ota_manager_start(url, NULL);
    if (err != ESP_OK) {
        char resp[128];
        snprintf(resp, sizeof(resp), "{\"success\":false,\"error\":\"%s\"}",
                 esp_err_to_name(err));
        httpd_resp_set_type(req, "application/json");
        httpd_resp_set_hdr(req, "Connection", "close");
        httpd_resp_send(req, resp, strlen(resp));
        return ESP_OK;
    }

    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send(req, "{\"success\":true}", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

