GYD-418/ota-esp32-stm32/ESPOTA/main/ESPOTA.c
/* ========================================================================
 *  Start OTA management HTTP server on STA interface
 * ======================================================================== */
static void start_ota_server(void)
{
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 6;
    config.stack_size = 6144;

    if (httpd_start(&s_ota_server, &config) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start OTA server");
        return;
    }

    httpd_uri_t uri_dashboard = {
        .uri = "/", .method = HTTP_GET,
        .handler = dashboard_handler,
    };
    httpd_register_uri_handler(s_ota_server, &uri_dashboard);

    httpd_uri_t uri_version = {
        .uri = "/api/version", .method = HTTP_GET,
        .handler = version_handler,
    };
    httpd_register_uri_handler(s_ota_server, &uri_version);

    httpd_uri_t uri_status = {
        .uri = "/api/ota/status", .method = HTTP_GET,
        .handler = ota_status_handler,
    };
    httpd_register_uri_handler(s_ota_server, &uri_status);

    httpd_uri_t uri_update = {
        .uri = "/api/ota/update", .method = HTTP_POST,
        .handler = ota_update_handler,
    };
    httpd_register_uri_handler(s_ota_server, &uri_update);

    httpd_uri_t uri_stm32_update = {
        .uri = "/api/stm32/update", .method = HTTP_POST,
        .handler = stm32_update_handler,
    };
    httpd_register_uri_handler(s_ota_server, &uri_stm32_update);

    httpd_uri_t uri_stm32_status = {
        .uri = "/api/stm32/status", .method = HTTP_GET,
        .handler = stm32_status_handler,
    };
    httpd_register_uri_handler(s_ota_server, &uri_stm32_status);

    ESP_LOGI(TAG, "OTA HTTP server started");
}

static void stop_ota_server(void)
{
    if (s_ota_server) {
        httpd_stop(s_ota_server);
        s_ota_server = NULL;
        ESP_LOGI(TAG, "OTA HTTP server stopped");
    }
}

/* ========================================================================
 *  WiFi event handler — maps async events to event group bits
 * ======================================================================== */
static void on_config_done(void);
static void auto_ota_task(void *arg);
static void boot_button_task(void *arg);

/* ========================================================================
 *  BOOT button task (GPIO0)
 * ======================================================================== */
static void boot_button_task(void *arg)
{
    gpio_config_t cfg = {
        .pin_bit_mask = (1ULL << 0),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
    };
    gpio_config(&cfg);

    int pressed = 0;
    while (1) {
        if (gpio_get_level(0) == 0) {  /* pressed (active low) */
            if (!pressed) {
                pressed = 1;
                vTaskDelay(pdMS_TO_TICKS(50));  /* debounce */
                if (gpio_get_level(0) == 0) {
                    if (!s_sta_netif || !wifi_config_ap_is_running()) {
                        /* Check if WiFi is connected */
                        wifi_ap_record_t ap;
                        if (esp_wifi_sta_get_ap_info(&ap) != ESP_OK) {
                            ESP_LOGI(TAG, "BOOT: No WiFi, starting config AP...");
                            status_led_ap_mode();
                            wifi_config_ap_start(AP_SSID_PREFIX, s_sta_netif, on_config_done);
                        } else {
                            ESP_LOGI(TAG, "BOOT: WiFi connected, checking updates...");
                            xTaskCreate(auto_ota_task, "auto_ota", 6144, NULL, 3, NULL);
                        }
                    }
                }
            }
        } else {
            pressed = 0;
        }
        vTaskDelay(pdMS_TO_TICKS(200));
    }
}

static void auto_ota_task(void *arg);
static void stm32_listen_task(void *arg)
{
    uint8_t buf[64];
    while (1) {
        if (!stm32_forwarder_is_running()) {
            int len = uart_read_bytes(UART_NUM_1, buf, sizeof(buf), pdMS_TO_TICKS(1000));
            if (len >= 7) {
                for (int i = 0; i <= len - 7; i++) {
                    if (buf[i] == 0xAA && buf[i+1] == 0x55 && buf[i+2] == 0x06) {
                        ESP_LOGI(TAG, "*** STM32 BOOT COMPLETE — OTA SUCCESS ***");
                        break;
                    }
                }
            }
        }
        vTaskDelay(pdMS_TO_TICKS(200));
    }
}
static void sta_event_handler(void *arg, esp_event_base_t event_base,
                              int32_t event_id, void *event_data)
{
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        xEventGroupSetBits(s_sta_evt_group, STA_STARTED_BIT);
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_SCAN_DONE) {
        xEventGroupSetBits(s_sta_evt_group, SCAN_DONE_BIT);
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        stop_ota_server();
        xEventGroupSetBits(s_sta_evt_group, STA_FAIL_BIT);
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
        ESP_LOGI(TAG, "STA IP: " IPSTR, IP2STR(&event->ip_info.ip));
        xEventGroupSetBits(s_sta_evt_group, STA_CONNECTED_BIT);
        status_led_wifi_connected();
        /* start OTA server only if config AP is NOT running (pure STA mode) */
        if (!s_ota_server && !wifi_config_ap_is_running()) {
            start_ota_server();
#if OTA_AUTO_CHECK
            xTaskCreate(auto_ota_task, "auto_ota", 6144, NULL, 3, NULL);
            xTaskCreate(stm32_listen_task, "stm_lsn", 4096, NULL, 2, NULL);
#endif
            /* Listen for STM32 boot messages */
        }
    }
}

/* ========================================================================
 *  try_scan_connect
 * ======================================================================== */
static bool try_scan_connect(void)
{
    if (!ssid_manager_has_saved()) {
        ESP_LOGI(TAG, "No saved credentials");
        return false;
    }

    EventBits_t started = xEventGroupWaitBits(s_sta_evt_group, STA_STARTED_BIT,
                                              pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
    if (!(started & STA_STARTED_BIT)) {
        ESP_LOGW(TAG, "STA start timeout");
        return false;
    }

    wifi_ssid_item_t saved_list[SSID_MANAGER_MAX_COUNT];
    int saved_count = 0;
    ssid_manager_get_list(saved_list, &saved_count);

