GYD-418/ota-esp32-stm32/ESPOTA/main/ESPOTA.c
    ESP_LOGI(TAG, "Scanning for %d saved SSID(s)...", saved_count);

    xEventGroupClearBits(s_sta_evt_group, SCAN_DONE_BIT);
    esp_wifi_scan_start(NULL, true);
    EventBits_t scan_bits = xEventGroupWaitBits(s_sta_evt_group, SCAN_DONE_BIT,
                                                pdTRUE, pdFALSE, pdMS_TO_TICKS(5000));
    if (!(scan_bits & SCAN_DONE_BIT)) {
        ESP_LOGW(TAG, "Scan timeout");
        return false;
    }

    uint16_t ap_count = 0;
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_num(&ap_count));
    if (ap_count == 0) {
        ESP_LOGW(TAG, "No APs found");
        return false;
    }

    wifi_ap_record_t *ap_records = calloc(ap_count, sizeof(wifi_ap_record_t));
    if (!ap_records) {
        ESP_LOGE(TAG, "OOM for scan records");
        return false;
    }
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_records(&ap_count, ap_records));
    ESP_LOGI(TAG, "Scan found %d AP(s)", ap_count);

    int best_rssi = -128;
    int best_channel = 0;
    char best_ssid[33] = {0};
    char best_password[65] = {0};

    for (int i = 0; i < ap_count; i++) {
        for (int j = 0; j < saved_count; j++) {
            if (strcmp((char *)ap_records[i].ssid, saved_list[j].ssid) == 0) {
                if (ap_records[i].rssi > best_rssi) {
                    best_rssi = ap_records[i].rssi;
                    best_channel = ap_records[i].primary;
                    strncpy(best_ssid, (char *)ap_records[i].ssid, 32);
                    strncpy(best_password, saved_list[j].password, 64);
                }
            }
        }
    }
    free(ap_records);

    if (best_ssid[0] == '\0') {
        ESP_LOGW(TAG, "No saved SSID found");
        return false;
    }

    ESP_LOGI(TAG, "Connecting to %s (RSSI=%d, ch=%d)...",
             best_ssid, best_rssi, best_channel);

    wifi_config_t sta_config = {0};
    strncpy((char *)sta_config.sta.ssid, best_ssid, sizeof(sta_config.sta.ssid));
    if (strlen(best_password) > 0) {
        strncpy((char *)sta_config.sta.password, best_password,
                sizeof(sta_config.sta.password));
        sta_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
    } else {
        sta_config.sta.threshold.authmode = WIFI_AUTH_OPEN;
    }
    sta_config.sta.channel = best_channel;
    sta_config.sta.scan_method = WIFI_FAST_SCAN;

    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &sta_config));

    xEventGroupClearBits(s_sta_evt_group, STA_CONNECTED_BIT | STA_FAIL_BIT);
    esp_wifi_connect();

    EventBits_t bits = xEventGroupWaitBits(s_sta_evt_group,
                       STA_CONNECTED_BIT | STA_FAIL_BIT,
                       pdTRUE, pdFALSE, pdMS_TO_TICKS(15000));

    if (bits & STA_CONNECTED_BIT) {
        ESP_LOGI(TAG, "Connected to %s!", best_ssid);
        ssid_manager_add(best_ssid, best_password);
        status_led_wifi_connected();
        return true;
    }

    ESP_LOGW(TAG, "Failed to connect to %s", best_ssid);
    status_led_wifi_connecting();  /* keep trying */
    return false;
}

/* ========================================================================
 *  Config done callback
 * ======================================================================== */
static void on_config_done(void)
{
    ESP_LOGI(TAG, "WiFi configured, transitioning to STA mode...");
    status_led_wifi_connecting();
    wifi_config_ap_stop();
    try_scan_connect();
}

/* ========================================================================
 *  STM32 boot message listener
 * ======================================================================== */

/* ========================================================================
 *  Auto OTA check task
 * ======================================================================== */
static void auto_ota_task(void *arg)
{
    /* Wait for WiFi to stabilize */
    vTaskDelay(pdMS_TO_TICKS(5000));

    ESP_LOGI(TAG, "Auto-checking for firmware updates...");

    /* ---- ESP32 check FIRST ---- */
    {
        ESP_LOGI(TAG, "Checking ESP32 firmware...");

        esp_http_client_config_t ecfg = {
            .url = ESP32_VERSION_URL,
            .timeout_ms = 10000,
            .buffer_size = 256,
            .skip_cert_common_name_check = true,
        };
        esp_http_client_handle_t eh = esp_http_client_init(&ecfg);
        if (eh) {
            if (esp_http_client_open(eh, 0) == ESP_OK) {
                int cl = esp_http_client_fetch_headers(eh);
                if (cl <= 0) cl = 128;
                char *b2 = malloc(cl + 1);
                if (b2) {
                    int t2 = 0;
                    while (t2 < cl) { int r2 = esp_http_client_read(eh, b2 + t2, cl - t2); if (r2 <= 0) break; t2 += r2; }
                    b2[t2] = '\0';
                    char *nl2 = strchr(b2, '\n');
                    if (nl2) *nl2 = '\0';
                    char *esp_ver = b2;
                    char last_esp_ver[64] = "";
                    nvs_handle_t n2;
                    if (nvs_open("ota_esp32", NVS_READONLY, &n2) == ESP_OK) {
                        size_t l2 = sizeof(last_esp_ver);
                        nvs_get_str(n2, "last_ver", last_esp_ver, &l2);
                        nvs_close(n2);
                    }
                    if (strlen(esp_ver) > 0 && strcmp(esp_ver, ota_manager_get_version()) != 0
                        && strcmp(esp_ver, last_esp_ver) != 0) {
                        ESP_LOGI(TAG, "New ESP32 version %s! Updating...", esp_ver);
                        char esp_url[256];
                        snprintf(esp_url, sizeof(esp_url), "%s/%s", ESP32_OTA_BASE_URL, "ESPOTA.bin");
                        status_led_ota_esp32(0);
                        ota_manager_start(esp_url, NULL);
                        if (nvs_open("ota_esp32", NVS_READWRITE, &n2) == ESP_OK) {
                            nvs_set_str(n2, "last_ver", esp_ver);
                            nvs_commit(n2); nvs_close(n2);
                        }
                        free(b2);
                        esp_http_client_close(eh);
                        esp_http_client_cleanup(eh);
                        goto done;  /* ESP32 update in progress, skip STM32 check */
                    }
                    ESP_LOGI(TAG, "ESP32 firmware up to date (%s)", esp_ver);
                    free(b2);
                }
                esp_http_client_close(eh);
            }
            esp_http_client_cleanup(eh);
        }
    }

