GYD-418/ota-esp32-stm32/ESPOTA/main/ESPOTA.c
    /* ---- STM32 check ---- */

    /* Step 1: HTTP GET version file */
    esp_http_client_config_t http_cfg = {
        .url = STM32_VERSION_URL,
        .timeout_ms = 10000,
        .buffer_size = 512,
        .skip_cert_common_name_check = true,
    };
    esp_http_client_handle_t http = esp_http_client_init(&http_cfg);
    if (!http) {
        ESP_LOGW(TAG, "Auto-check: HTTP init failed");
        goto done;
    }

    esp_err_t ret = esp_http_client_open(http, 0);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Auto-check: HTTP open failed");
        esp_http_client_cleanup(http);
        goto done;
    }

    int content_len = esp_http_client_fetch_headers(http);
    if (content_len <= 0) content_len = 256;

    char *buf = malloc(content_len + 1);
    if (!buf) {
        esp_http_client_close(http);
        esp_http_client_cleanup(http);
        goto done;
    }

    int total = 0;
    while (total < content_len) {
        int r = esp_http_client_read(http, buf + total, content_len - total);
        if (r <= 0) break;
        total += r;
    }
    buf[total] = '\0';

    esp_http_client_close(http);
    esp_http_client_cleanup(http);

    /* Step 2: Parse version file (format: version\nfilename) */
    char *newline = strchr(buf, '\n');
    char filename_buf[128] = {0};
    if (newline) {
        *newline = '\0';
        strncpy(filename_buf, newline + 1, sizeof(filename_buf) - 1);
        /* Trim trailing \r \n */
        for (int i = strlen(filename_buf) - 1; i >= 0; i--) {
            if (filename_buf[i] == '\r' || filename_buf[i] == '\n')
                filename_buf[i] = '\0';
            else break;
        }
    }
    char *version = buf;

    ESP_LOGI(TAG, "Auto-check: server version=%s, file=%s", version, filename_buf);

    /* Step 3: Compare with NVS-stored version */
    nvs_handle_t nvs;
    char last_ver[64] = "";
    if (nvs_open("ota_stm32", NVS_READONLY, &nvs) == ESP_OK) {
        size_t len = sizeof(last_ver);
        nvs_get_str(nvs, "last_ver", last_ver, &len);
        nvs_close(nvs);
    }

    if (strlen(version) > 0 && strcmp(version, last_ver) != 0) {
        ESP_LOGI(TAG, "New STM32 version %s (was %s)! Triggering OTA...", version, last_ver);
        char full_url[256];
        snprintf(full_url, sizeof(full_url), "%s/%s", STM32_OTA_BASE_URL,
                 strlen(filename_buf) > 0 ? filename_buf : "OTAESP32STM32.bin");
        status_led_ota_stm32(0);
        stm32_forwarder_start(full_url, NULL);

        /* Save new version */
        if (nvs_open("ota_stm32", NVS_READWRITE, &nvs) == ESP_OK) {
            nvs_set_str(nvs, "last_ver", version);
            nvs_commit(nvs);
            nvs_close(nvs);
        }
    } else {
        ESP_LOGI(TAG, "Auto-check: STM32 firmware is up to date (ver %s)", last_ver);
    }

    free(buf);

    /* ---- ESP32 check (only if STM32 didn't start OTA) ---- */
    if (!stm32_forwarder_is_running()) {
        ESP_LOGI(TAG, "Checking ESP32 firmware...");
    {
        esp_http_client_config_t ecfg = {
            .url = ESP32_VERSION_URL, .timeout_ms = 10000, .buffer_size = 256,
            .skip_cert_common_name_check = true,
        };
        esp_http_client_handle_t eh = esp_http_client_init(&ecfg);
        if (eh && esp_http_client_open(eh, 0) == ESP_OK) {
            int cl = esp_http_client_fetch_headers(eh);
            if (cl <= 0) cl = 128;
            char *b2 = malloc(cl + 1);
            if (b2) {
                int t2 = 0;
                while (t2 < cl) { int r2 = esp_http_client_read(eh, b2 + t2, cl - t2); if (r2 <= 0) break; t2 += r2; }
                b2[t2] = '\0';
                char *nl2 = strchr(b2, '\n');
                if (nl2) *nl2 = '\0';
                char *esp_ver = b2;
                char last_esp_ver[64] = "";
                nvs_handle_t n2;
                if (nvs_open("ota_esp32", NVS_READONLY, &n2) == ESP_OK) {
                    size_t l2 = sizeof(last_esp_ver);
                    nvs_get_str(n2, "last_ver", last_esp_ver, &l2);
                    nvs_close(n2);
                }
                if (strlen(esp_ver) > 0 && strcmp(esp_ver, ota_manager_get_version()) != 0
                    && strcmp(esp_ver, last_esp_ver) != 0) {
                    ESP_LOGI(TAG, "New ESP32 version %s! Updating...", esp_ver);
                    char esp_url[256];
                    snprintf(esp_url, sizeof(esp_url), "%s/%s", ESP32_OTA_BASE_URL, "ESPOTA.bin");
                    status_led_ota_esp32(0);
                    ota_manager_start(esp_url, NULL);
                    if (nvs_open("ota_esp32", NVS_READWRITE, &n2) == ESP_OK) {
                        nvs_set_str(n2, "last_ver", esp_ver);
                        nvs_commit(n2); nvs_close(n2);
                    }
                } else {
                    ESP_LOGI(TAG, "ESP32 up to date (%s)", esp_ver);
                }
                free(b2);
            }
            esp_http_client_close(eh);
        }
        if (eh) esp_http_client_cleanup(eh);
    }
    } /* end if !forwarder_running */

done:
    vTaskDelete(NULL);
}

/* ========================================================================
 *  app_main
 * ======================================================================== */
void app_main(void)
{
    /* ---- NVS flash init ---- */
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    /* ---- WiFi credential manager ---- */
    ssid_manager_init();
    xTaskCreate(boot_button_task, "boot_btn", 3072, NULL, 2, NULL);

    /* ---- Status LED ---- */
    status_led_init();
    status_led_wifi_connecting();

    /* ---- OTA manager (print version/partition info) ---- */
    ota_manager_init();

    /* ---- STM32 forwarder (UART + SPI) ---- */
    stm32_forwarder_init();

    /* ---- netif + event loop + wifi driver ---- */
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    s_sta_netif = esp_netif_create_default_wifi_sta();

    /* ---- event group + handlers ---- */
    s_sta_evt_group = xEventGroupCreate();
    esp_event_handler_instance_t wifi_inst = NULL;
    esp_event_handler_instance_t ip_inst = NULL;
    ESP_ERROR_CHECK(esp_event_handler_instance_register(
        WIFI_EVENT, ESP_EVENT_ANY_ID, &sta_event_handler, NULL, &wifi_inst));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(
        IP_EVENT, IP_EVENT_STA_GOT_IP, &sta_event_handler, NULL, &ip_inst));

    /* ---- WiFi init + start ---- */
    wifi_init_config_t wifi_cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&wifi_cfg));
    ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    xEventGroupClearBits(s_sta_evt_group, STA_STARTED_BIT);
    ESP_ERROR_CHECK(esp_wifi_start());

    /* ---- connect or start config AP ---- */
    bool connected = false;
    for (int attempt = 0; attempt < 3 && !connected; attempt++) {
        if (attempt > 0) {
            ESP_LOGI(TAG, "Retry %d/2...", attempt);
            vTaskDelay(pdMS_TO_TICKS(3000));
        }
        connected = try_scan_connect();
    }

    if (!connected) {
        ESP_LOGI(TAG, "Starting config AP...");
        status_led_ap_mode();
        wifi_config_ap_start(AP_SSID_PREFIX, s_sta_netif, on_config_done);
        ESP_LOGI(TAG, "Config AP: ESP32-OTA-XXXX, http://192.168.4.1");
    }

    /* ---- main loop ---- */
    ESP_LOGI(TAG, "System ready. Version: %s", ota_manager_get_version());
    while (true) {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}